Revit 2024 API
SpatialElementGeometryCalculator Members
The SpatialElementGeometryCalculator type exposes the following members.
Constructors
Name | Description
SpatialElementGeometryCalculator(Document)
 Constructs a new calculator with default options for the geometry of spatial elements.
SpatialElementGeometryCalculator(Document, SpatialElementBoundaryOptions)
 Constructs a new calculator for the geometry of spatial elements.
Methods
Name | Description
CalculateSpatialElementGeometry
 Compute the spatial element geometry and returns the boundary face information.
CanCalculateGeometry
 This indicates whether the input spatial element is a valid one.
Dispose
Releases all resources used by the SpatialElementGeometryCalculator
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOptions
 The options that control the calculation.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsRoomOrSpace
 This indicates whether the input spatial element is a room or a space.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace